//
//  HTML_CSS_JS_渡一.h
//  MyCode
//
//  Created by New_iMac on 2021/4/27.
//  Copyright © 2021 mycode. All rights reserved.
//

#ifndef HTML_CSS_JS____h
#define HTML_CSS_JS____h


// 渡一前端（姬成）
/*
 // 第一课
https://www.bilibili.com/video/BV19b411N7Fz?share_source=copy_web
// 第二课
https://www.bilibili.com/video/BV19b411N7Fz?p=2&share_source=copy_web
// 一共34小节


01_课程前导_（07:33）
02_课前须知及「编辑器」使用方法_（08:52）
03_html 初级篇 - 基础标签_（49:42）
04_html 进阶篇 - 高级标签_（1:57:19）
05_css初级篇-css引入css基础选择器选择器权重_（1:24:53）
06_学员必听_（01:26）
07_css复杂选择器，权重计算问题，css基础属性_（1:10:11）
08_css企业开发经验、习惯，盒子模型，层模型_（2:03:43）
09_实例：居中五环,两栏布局,两个经典bug,BFC_（56:47）
10_简短而重要的环节_（04:42）
11_css 高级篇-包裹浮动元素,开发实例,经验_（29:16）
12_文字溢出处理，背景图片处理，企业开发经验_（33:04）
13_一个特别的辅助工具_（04:16）
14_css 升华篇 - css要点补充说明_（14:52）
15_css 升华篇 - 项目演练_（23:29）
16_大学篇_（40:17）
17_职业篇_（46:34）
18_桃李不言，下自成蹊_（40:17）
19_01-项目前准备_（17:35）
20_02-基本结构与样式_（1:01:07）
21_03-头部信息结构_（21:21）
22_04-头部信息样式与自定义图标_（47:08）
23_05-头部广告结构与样式_（49:02）
24_06-头部搜索结构与样式_（1:11:25）
25_07-导航结构与样式_（22:00）
26_08-首屏内容结构_（24:41）
27_09-侧边导航结构与样式_（31:45）
28_10-图片区域结构与样式_（27:32）
29_11-淘宝头条结构与样式_（14:33）
30_12-用户区域结构与样式_（32:03）
31_13-公告区域结构与样式_（15:00）
32_14-图标区域结构与样式_（35:09）
33_15-有好货爱逛街结构与样式_（40:44）
34_16-右侧固定导航结构与样式_（32:42）
 
 */





// js（姬成）
/*
 
 https://www.bilibili.com/video/BV1f4411R7M5?share_source=copy_web
 // 第二篇
 https://www.bilibili.com/video/BV1f4411R7M5?p=2&share_source=copy_web
 https://www.bilibili.com/video/BV1f4411R7M5?p=7&share_source=copy_web
 
 
01_课程前导_（07:33）
02_课前须知及「编辑器」使用方法_（08:52）
03_javascript 浏览器发展史_（1:03:16）
04_js介绍,入门,js引入,变量,值类型,运算符_（1:59:02）
05_比较运算符,逻辑运算符_（42:04）
06_学员必听_（01:26）
07_条件语句,循环语句_（1:51:20）
08_条件语句补充，初始引用值_（1:01:38）
09_typeof，类型转换_（1:24:34）
10_函数，小练习，初始作用域（上）_（56:06）
11_函数，小练习，初始作用域（下）_（23:32）
12_递归，预编译（上）_（1:40:26）
13_一个特别的辅助工具_（04:16）
14_递归，预编译（下）_（50:06）
15_作用域、作用域链精解_（41:51）
16_立即执行函数_（1:17:38）
17_闭包_（42:43）
18_闭包精细版_（2:26:03）
19_对象，包装类（上）_（58:22）
20_对象，包装类（下）_（1:11:05）
21_原型，原型链，call/apply（上）_（41:29）
22_原型，原型链，call/apply（下）_（1:50:37）
23_继承模式，命名空间，对象枚举（上）_（54:18）
24_继承模式，命名空间，对象枚举（下）_（1:11:40）
25_this，笔试真题讲解（上）_（56:31）
26_this，笔试真题讲解（下）_（53:03）
27_arguments，克隆_（32:27）
28_三目运算符_（1:26:52）
29_数组，类数组_（20:19）
30_加入渡一学习群的途径_（02:33）
31_数组去重，习题，答疑复习（上）_（26:51）
32_数组去重，习题，答疑复习（下）_（1:15:03）
33_try..catch，es5标准模式_（53:31）
34_dom操作初探_（1:02:46）
35_桃李不言，下自成蹊_（40:17）
36_dom选择器，节点类型_（1:37:50）
37_dom继承树，dom基本操作（上）_（33:38）
38_dom继承树，dom基本操作（中）_（1:09:49）
39_dom继承树，dom基本操作（下）_（04:31）
40_date对象，定时器（上)_（51:33）
41_date对象，定时器（中)_（23:01）
42_date对象，定时器（下)_（05:33）
43_获取窗口属性，获取dom尺寸，脚本化CSS(上)_（1:21:03）
44_获取窗口属性，获取dom尺寸，脚本化CSS(下)_（59:09）
45_事件1（上）_（22:36）
46_事件1（下）_（1:04:12）
47_事件2_（1:38:21）
48_json，异步加载，时间线（上）_（1:15:24）
49_json，异步加载，时间线（下）_（29:57）
50_正则表达式（上）_（1:04:10）
51_正则表达式（下）_（1:18:07）
52_大学篇_（40:17）
53_职业篇_（46:34）
54_原生JS游戏实战开发-贪吃蛇1_（1:38:57）
55_原生JS游戏实战开发-贪吃蛇2_（1:22:09）
56_原生JS游戏实战开发-扫雷1_（1:59:24）
 
 */

 



/*
02_关于PS软件下载_02:57
03_认识主界面_09:41
04_创建打开及保存_11:08
05_使用须知和准备_09:02
06_辅助工具_08:16
07_关于学习笔记_08:00
08_图层的基础知识_27:40
09_移动工具详解_11:06
10_选区的工作原理_16:57
11_魔法选择工具_22:35
12_选框类工具_33:07
13_关于提升操作能力_06:40
14_画笔及橡皮擦_27:09
15_图像修复工具_37:56
16_调整类工具_21:22
17_渐变工具_12:53
18_万能的钢笔工具_17:33
19_形状工具1_36:50
20_形状工具2_28:19
21_关于快捷键设置和记忆的小技巧_05:26
22_文字处理工具_27:23
23_变换控件与变形_39:16
24_智能对象图层_16:53
25_关于圈子里的那些事儿_05:38
26_色彩理论_23:24
27_通道_12:54
28_四大蒙版_26:06
29_混合模式_18:40
30_调整图层（明暗）_23:18
31_调整图层（色彩）_33:18
32_调整图层（去色）_16:26
33_图层样式_48:04
34_神奇滤镜（模糊）_13:05
35_神奇滤镜（锐化）_11:40
36_神奇滤镜（扭曲）_19:30
37_神奇滤镜（液化）_12:42
38_神奇滤镜（常用）_25:14
39_滤镜库_09:21
 
 
 */




#endif /* HTML_CSS_JS____h */
