
//  java_马士兵.h
//  MyCode

//  Created by New_iMac on 2021/4/27.
//  Copyright © 2021 mycode. All rights reserved.


#ifndef java_____h
#define java_____h


#pragma mark
#pragma mark -->> Java基础入门【官方】马士兵2021年Java零基础入门到阿里P8架构师400集全集

/*
共309节
https://www.bilibili.com/video/BV1Sk4y1C7TC  // 视频地址
https://www.bilibili.com/video/BV1Sk4y1C7TC?share_source=copy_web // 第一节
https://www.bilibili.com/video/BV1Sk4y1C7TC?p=2&share_source=copy_web // 第二节


01__引入_授课说明__09:58__
02__引入_课程所需资料获取__00:34
03__课程引入_如何安装软件__08:51
04__课程引入_如何提高打字速度__06:48
05__初始JAVA_计算机语言的发展历史__11:05
06__初始JAVA_JAVA简史__15:02
07__初始JAVA_JAVA体系结构__03:26
08__初始JAVA_JAVA特性和优势__05:05
09__初始JAVA_核心机制之垃圾收集机制__07:12
10__初始JAVA_核心机制之JAVA跨平台原理__16:00
11__初始JAVA_核心机制之对比C语言的跨平台原理__09:27
12__初始JAVA_常用DOS命令__17:35
13__初始JAVA_JDK的下载_安装_卸载__10:20
14__初始JAVA_notepad++的安装_系统环境变量path__19:59
15__初始JAVA_第一段程序_编译_执行__16:41
16__初始JAVA_程序中常见错误__16:07
17__初始JAVA_编译方式__04:11
18__初始JAVA_扩展：classpath环境变量__08:02
19__初始JAVA_扩展：JAVA_HOME环境变量__05:56
20__初始JAVA_API__05:14
21__初始JAVA_代码量统计工具的使用__02:51
22__初始JAVA_单行注释和多行注释__11:58
23__初始JAVA_文档注释__09:10
24__初始JAVA_反编译工具的使用__06:22
25__初始JAVA_本章最后一段代码__10:34
26__重写__10:42
27__数据类型_标识符__08:48
28__数据类型_关键字__01:23
29__数据类型_常量_字面常量__04:01
30__数据类型_变量的声明,赋值,使用__14:09
31__数据类型_变量的内存__21:18
32__数据类型_变量的作用域__07:10
33__数据类型_基本数据类型之整数类型常量_进制转换问题__23:02
34__数据类型_基本数据类型之整数类型变量__17:24
35__数据类型_基本数据类型之浮点类型常量的两种形式__01:20
36__数据类型_基本数据类型之浮点类型变量__16:11
37__数据类型_编码和字符集__26:28
38__数据类型_基本数据类型之字符类型1__16:41
39__数据类型_基本数据类型之字符类型2__12:48
40__数据类型_解释乱码问题__03:29
41__数据类型_基本数据类型之布尔类型__05:35
42__数据类型_基本数据类型转换问题__20:26
43__数据类型_习题_final_字符常量_Scanner的使用__23:03
44__数据类型_习题_加深对Scanner的使用__15:12
45__运算符_Java中的运算符概述__01:08
46__运算符_算术运算符_除法_取余__12:17
47__运算符_算术运算符_加号__08:38
48__运算符_算术运算符_自增__14:25
49__运算符_赋值运算符__12:47
50__运算符_扩展赋值运算符__15:43
51__运算符_关系运算符__04:52
52__运算符_逻辑运算符__21:40
53__运算符_三元运算符__13:29
54__运算符_位运算符__31:10
55__运算符_总结__00:24
56__运算符_运算符的优先级别__05:29
57__流程控制_引入__04:50
58__流程控制_分支结构_if单分支__20:15
59__流程控制_分支结构_if多分支__14:25
60__流程控制_分支结构_if双分支__03:46
61__流程控制_随机数__07:54
62__流程控制_分支的嵌套使用_练习1__18:40
63__流程控制_分支的嵌套使用_练习2__10:26
64__流程控制_分支结构_switch分支__20:32
65__流程控制_循环结构_while循环__26:35
66__流程控制_循环结构_while循环练习__09:25
67__流程控制_循环结构_do-while循环__10:39
68__流程控制_循环结构_for循环__13:11
69__流程控制_循环结构_关键字break__17:02
70__流程控制_循环结构_关键字continue__12:42
71__流程控制_循环结构_关键字return__03:23
72__流程控制_循环结构_循环练习1__05:46
73__流程控制_循环结构_循环练习2__13:43
74__流程控制_循环结构_循环嵌套(双重)_乘法口诀__14:03
75__流程控制_循环结构_循环嵌套(双重)_打印各种形状__17:40
76__流程控制_循环结构_循环嵌套(双重)_打印菱形的方式2__14:05
77__流程控制_循环结构_循环嵌套(三重)_百钱买百鸡__13:46
78__方法_方法的定义和调用__35:27
79__方法_方法提取的练习__11:23
80__小结，马老师在线答疑，P8课程介绍__1:05:44
81__方法_方法的重载__22:36
82__数组_数组的引入__11:29
83__数组_数组的学习__29:02
84__数组_数组习题完善_数组的遍历方式__17:33
85__数组_数组的三种初始化方式__04:40
86__数组_数组的应用_最值问题__22:05
87__数组_数组的应用_查询问题__15:18
88__数组_数组的应用_添加元素__17:17
89__数组_数组的应用_删除元素__14:22
90__数组_详述main方法__15:12
91__数组_可变参数__10:00
92__数组_Arrays工具类的使用__17:05
93__数组_数组的复制__07:58
94__数组_二维数组的定义和遍历__20:42
95__数组_二维数组的初始化方式__06:27
96__IDEA学习说明__02:00
97__IDE的概念__05:46
98__JetBrains公司介绍__03:17
99__IntelliJ IDEA介绍__02:39
100__IDEA的下载_安装前的准备工作__03:44
101__IDEA的卸载__02:42
102__IDEA的安装和破解__12:15
103__IDEA页面展示__03:25
104__Module的概念和使用__13:05
105__IDEA的常用设置1__16:31
106__IDEA的常用设置2__09:30
107__IDEA的常用设置3__08:24
108__IDEA的常用快捷键1__11:21
109__IDEA的常用快捷键2__10:22
110__代码模板是什么__07:44
111__常用代码模板__08:48
112__修改代码模板__04:03
113__创建代码模板__09:21
114__断点调试_常用断点调试快捷键__12:17
115__断点调试_条件判断__01:35
116__断点调试_查看表达式值__01:20
117__面向对象_面向过程和面向对象的区别__19:06
118__面向对象_类和对象的关系__08:08
119__面向对象_面向对象三个阶段__05:21
120__面向对象_创建类__11:26
121__面向对象_创建对象__16:28
122__面向对象_局部变量和成员变量的区别__13:41
123__面向对象_构造器__20:27
124__面向对象_构造器的重载__15:30
125__面向对象_内存分析1__09:58
126__面向对象_内存分析2__09:36
127__面向对象_内存分析3__20:12
128__面向对象_this的使用__26:38
129__面向对象_static修饰属性__22:17
130__面向对象_static修饰方法__09:18
131__面向对象_代码块__12:31
132__面向对象_包_import_(1)__20:07
133__面向对象_包_import_(2)__13:11
134__面向对象_封装(1)__21:53
135__面向对象_封装(2)__12:05
136__面向对象_封装的总结__01:45
137__面向对象_继承的引入__12:18
138__面向对象_继承的代码演示__15:24
139__面向对象_继承总结__08:51
140__面向对象_继承的内存分析__05:28
141__面向对象_权限修饰符__11:34
142__面向对象_方法的重写__19:45
143__面向对象_super修饰属性,方法__09:51
144__面向对象_super修饰构造器__13:57
145__面向对象_super修饰构造器补充__05:06
146__面向对象_继承条件下构造方法的执行过程__07:08
147__面向对象_Object类的toString方法__25:35
148__面向对象_Object类的equals方法(1)__17:25
149__面向对象_Object类的equals方法(2)_instanceof__06:11
150__面向对象_Object类的equals方法(3)__18:14
151__面向对象_类和类之间的关系(1)__22:33
152__面向对象_类和类之间的关系(2)__05:43
153__面向对象_多态(1)__18:30
154__面向对象_多态(2)__13:00
155__面向对象_多态内存分析__07:09
156__面向对象_向下转型_向上转型__14:36
157__面向对象_简单工厂设计模式__10:12
158__面向对象_final修饰符__19:37
159__面向对象_抽象类_抽象方法__20:15
160__面向对象_接口(JDK1.8之前)__25:32
161__面向对象_接口(JDK1.8之后新增)__16:46
162__面向对象_内部类_成员内部类__18:06
163__面向对象_内部类_局部内部类__10:00
164__作业_面向对象项目__01:32
165__什么是SSLTLSHTTPSX509，SSL只能用在HTTP上吗__22:08
166__Https底层原理，对称加密与非对称加密__52:25
167__CA机构参与与CA伪造__14:18
168__P8架构师课程__44:08
169__索引的底层数据结构是B+还是B+树？__10:34
170__在MySQL里面，除了B+树之外，还有没有别的数据结构？__02:26
171__innoDB是否支持hash索引__03:32
172__MySQL优化前置知识：磁盘预读__04:57
173__MySQL数据结构选择__03:34
174__Java程序员必须知道的扰动函数__01:50
175__ash表的索引格式__03:19
176__二叉树，红黑树的索引格式__04:16
177__前缀索引实例说明__31:13
178__MySQL数据结构之最左匹配__27:59
179__索引下推__18:58
180__MySQL：可以解释一下什么叫MRR吗？__03:40
181__MySQL：可以解释一下什么叫FIC吗？__06:18
182__不同存储引擎索引的区别及数据存储方式__14:39
183__索引的匹配__19:34
184__索引的分类__03:42
185__索引的匹配方式__14:40
186__哈希索引__03:37
187__组合索引__15:23
188__索引覆盖__07:16
189__索引优化小细节__1:03:08
190__全方位解析MySQL__30:04
191__MySQL索引详解__53:52
192__MySQL的事务__39:47
 
193__Spring IOC是什么__05:36
194__IOC容器设计__03:44
195__Spring容器是怎么样创建对象的__09:14
196__Spring bean定义信息__03:10
197__手撕SpringIOC源码__1:30:14
198__什么是循环依赖__07:47
199__通过三级缓存来解决循环依赖问题__1:04:52
 
200__什么是spring boot__07:33
201__spring boot源码解析__2:09:08
 
/**************************************************
 跟193~199内容重复
202__Spring IOC是什么__05:36
203__IOC容器设计__03:44
204__Spring容器是怎么样创建对象的__09:14
205__Spring bean定义信息__03:10
206__手撕SpringIOC源码__1:30:14
207__什么是循环依赖__07:47
208__通过三级缓存来解决循环依赖问题__1:04:52
/**************************************************
 
209__tcp ip在开发中的作用什么是socket__22:58
210__什么是三次握手四次挥手__53:34
211__详解IP，路由器网关__3:23:21
212__为什么要学习IO，以及本次课程如何学习__05:49
213__计算机里面有哪些硬件组成以及运行原理__19:20
214__网络通信IO的演变过程__41:17
215__内核怎么去实现，以及NIO原理详解__25:12
216__nio的优势和弊端__09:41
217__多路复用器原理详解__10:54
218__select poll,多路复用器优势__09:17
219__NIO EPOLL深度原理解析__1:02:46
220__课程答疑__57:20
 
221__本次课程介绍—必听__02:48
222__计算机组成，程序运行的底层原理__23:11
223__线程切换以及，Java，GO,rest线程模型__14:57
224__Java里面有没有协程__01:08
225__锁的概念__14:59
226__synchronized关键字的字节码原语__41:38
227__偏向锁升级过程__24:52
228__小结，马老师在线答疑，P8课程介绍__1:05:44
229__CPU，内存，缓存，缓存行详解__28:04
230__缓存一致性协议，FalseSharing以及其编程技巧__15:52
231__CPU乱序执行概念丨CPU乱序执行的证明DCL为什么不能乱序volatil__36:49
232__volatile如何阻止乱序丨内存屏障__10:25
233__硬件级别的内存屏障到底怎么实现__10:45
234__马士兵老师在线给同学们定制化学习__13:18
235__P8架构师课程介绍__14:13
236__马士兵老师职业规划__1:00:59
237__什么是垃圾？__12:36
238__在分代模型的情况下是怎么分配一个对象的？__1:01:48
239__垃圾回收器的诞生和发展以及如何调优__52:24
240__马士兵老师P8架构师课程介绍，职业生涯规划__1:39:12
241__请解释一下对象的创建过程__09:38
242__加问DCL与volatile问题(指令重排)__32:32
243__对象在内存中的存储布局 (对象导数组的存储不同)__07:50
244__对象头具体包括什么__14:15
245__对象怎么定位？__05:28
246__对象怎么分配__15:32
 247__一个Object占多少字节__05:16
248__Class实例究竞在Method Area还是在Heap__06:24
249__JVM调优调的是什么？(Java虚拟机参数基本介绍)__04:42
250__JVM调优应该调哪三个部分？(规划和预调优，生产环境优化，OOM分析)__02:34
 
 
251__第一个OOM案例：银行系统，数据风险分析业务场景__14:56
252__第一个OOM案例，如何在JVM调优中定位问题(jps,jinfo,jstack,__09:56
253__第一个OOM案例：生产中为什么不能使用jconsole和jvisualvm__08:21
254__hashmap的数据结构__10:27
255__hashmap源码的常量值解释__15:44
256__hashmap源码的put方法讲解__15:50
257__hashmap 1.7版本的死循环问题__04:00
 258__hashmap 1.8版本的源码讲解__24:31
259__hashmap总结__14:26
260__TCP,IP应用层协议原理__32:01
261__TCP,IP传输控制层原理__38:01
262__TCP ip 网络层原理__17:01
263__TCPIP 链路层原理__21:38
264__什么是缓存穿透__08:17
265__导致缓存穿透的黑客攻击场景一__02:18
266__导致缓存穿透的黑客攻击场景二__01:08
 
 267__普通过滤器解决高频缓存穿透的弊端__06:38
268__布隆过滤器-布隆算法原理__21:55
269__缓存雪崩的解决方案__06:30
270__什么是缓存击穿__01:32
271__缓存击穿的解决方案1__01:03
272__缓存击穿的解决方案2-分布式锁__18:16
273__什么是zookeeper,原理剖析__19:12
274__zookeeper分布式原理__11:38
275__zookeeper分布式锁解决缓存击穿__07:01
276__关于zookeeper及缓存问题的面试指导__16:19
277__面试被问到高并发该怎么说__40:43
278__高并发系统中tps是怎么算的__21:20
279__如何在传统项目中找到高并发的点__07:01
280__分布式锁是什么，什么场景下用分布式锁？__28:10
281__两大类分布式锁__12:50
282__redis分布式锁原理__45:39
283__zookeeper分布式锁原理__38:45
284__职业生涯规划__1:02:25
285__redis. kafka. nginx的底层__38:01
286__redis与zookeeper的集群模型__38:01
287__分布式工艺和模式__38:01
288__技术的密码和乐趣__30:43
289__Redis，zookeeper，kafka，Nginx技术串讲__59:01
290__Redis，zookeeper，kafka，Nginx技术串讲（中）__45:01
291__Redis，zookeeper，kafka，Nginx技术串讲（下）__39:49
292__计算向数据移动、而非数据向计算移__24:10
293__redis的5大Value类型解析__24:01
294__redis实现活跃用户__24:01
295__redis实现秒杀__24:01
296__redis实现排行榜__24:01
297__redis实现推荐系统__03:40
// 298__小结，周老师直播答疑与职业规划__1:48:52
299__linux系统的支持：fork、copy on write__45:01
300__redis的持久化：RDB、AOF、RDB&AOF混合使用__30:15
// 301__学习路线规划，职业生涯指引__2:22:56
302__算法题【1】__05:50
303__算法题【2】__38:28
304__算法题【3】__43:13
305__算法题【4】__39:25
306__算法题【5】__23:06
307__算法题【6】__26:45
308__算法题【7】__56:40
309__算法题【8】__1:03:13
 
*/


#pragma mark
#pragma mark -->> 数据结构与算法：Leetcode刷题班丨 2020年最新数据结构与算法讲解，左程云&马士兵老师带你吊打大厂面试官
/**
 共33节
 https://www.bilibili.com/video/BV1bK411P7Kb
 https://www.bilibili.com/video/BV1bK411P7Kb?share_source=copy_web
 https://www.bilibili.com/video/BV1bK411P7Kb?p=2&share_source=copy_web
 
01__应届生进大厂学习路线规划__05:06
02__社招生怎么就进大厂？__15:43
03__数据结构与算法预告__07:20
04__算法基本概念__22:20
05__排序算法-宋词记忆法__10:43
06__选择排序__14:18
07__选择排序_程序编写__23:00
08__选择排序大O分析-视频导出__14:38
09__选择排序结尾__10:50
10__冒泡排序__15:52
11__插入排序__14:08
12__总结简单排序-选择、插入、冒泡__01:53
13__希尔排序__28:13
14__归并排序（一）__29:46
15__归并排序（二）__17:47
16__归并排序（三）__14:48
17__快速排序(一)__11:32
18__快速排序（二）__11:11
19__快速排序（三）__14:16
20__快速排序（四）__10:43
21__扩展内容-双轴快排-字幕-最终__26:58
22__计数排序(一)__21:24
23__计数排序（二）__09:49
24__基数排序__15:49
25__桶排序__12:13
26__【Leetcode原题】给定一个每一行有序，每一列也有序的二维数组matrix，再给定一个数num，返回matrix中是否有这个数__05:50
27__【Leetcode原题】给定一个只由0和1组成的二维数组matrix,每一行都可以保证所有的0在左侧，1在右侧，哪些行拥有最多数量的1，请放入- -个列表返回__38:28
28__给你一个二维数组matrx.所有数都是整数请你把其中所有的D傲 上下左右方向的延伸，返回处理之后的matnx比如，注意其中有两个0，那么每个0都向上下左右延伸__43:13
29__【Leetcode原题】给你一个随机函数f，等概率返回1~5中的一个数字，这是你唯一可以使用的随机机制，如何实现等概率返回1~ 7中的一个数字__39:25
30__【Leetcode原题】给你一个随机函数f，等概率返回1~5中的一个数字，这是你唯一可以使用的随机机制，如何实现等概率返回1~ 7中的一个数字__23:06
31__【Leetcode原题】给你一个随机函数f,以p概率返回0;以1- p概率返回1，这是你唯一可以使用的随机机制，如何实现等概率返回0和1__26:45
32__给定一个长度为N的数组arr,和一个大于1的正数K如果有哪些数出现次数大于N/K，就返回这些数要求:时间复杂度O(N)，额外空间复杂度O(K)__56:40
33__京东原题__1:03:13
 
 
 
 */




#pragma mark
#pragma mark
#pragma mark -->> MYSQL :马士兵老师直播，最全 MySQL 优化方法，从此优化不再难丨带你彻底了解 MySQL的各种底层实现机制，横扫一切关于MqSQL的面试问题

/**
 共24节
 https://www.bilibili.com/video/BV1tK411p74B
 https://www.bilibili.com/video/BV1tK411p74B?share_source=copy_web
 https://www.bilibili.com/video/BV1tK411p74B?p=2&share_source=copy_web
 
01__索引的底层数据结构是B+还是B+树？__10:34
02__在MySQL里面，除了B+树之外，还有没有别的数据结构？__02:26
03__innoDB是否支持hash索引__03:32
04__MySQL优化前置知识：磁盘预读__04:57
 05__MySQL数据结构选择__03:34
 06__Java程序员必须知道的扰动函数__01:50
07__hash表的索引格式__03:19
08__二叉树，红黑树的索引格式__04:16
09__前缀索引实例说明__31:13
 10__MySQL数据结构之最左匹配__27:59
11__索引下推__18:58
 12__MySQL：可以解释一下什么叫MRR吗？__03:40
13__MySQL：可以解释一下什么叫FIC吗？__06:18
14__不同存储引擎索引的区别及数据存储方式__14:39
15__索引的匹配__19:34
16__索引的分类__03:42
17__索引的匹配方式__14:40
18__哈希索引__03:37
19__组合索引__15:23
20__索引覆盖__07:16
21__索引优化小细节__1:03:08
22__全方位解析MySQL__30:04
23__MySQL索引详解__53:52
24__MySQL的事务__39:47
 
 */




#pragma mark
#pragma mark -->> SPRING :Spring源码解析丨如何读源码丨源码解读最快捷方式丨Spring源码深度解读丨Spring源码设计及其原理

/**
 共2节
 https://www.bilibili.com/video/BV1bC4y1H7oo
 https://www.bilibili.com/video/BV1bC4y1H7oo?share_source=copy_web
 https://www.bilibili.com/video/BV1bC4y1H7oo?p=2&share_source=copy_web
 
1__spring简介丨spring入门介绍 spring从入门到放弃丨__30:02
2__Spring源码解析丨如何读源码丨源码解读最快捷方式丨Spring源码深度解读__30:11
 
 */


#pragma mark
#pragma mark -->> TCP/IP三次握手四次挥手: 卧槽！牛皮了，头一次见有大佬把TCP/IP三次握手四次挥手和HTTP、HTTPS解释的这么明白
 
/**
 共16节
 https://www.bilibili.com/video/BV1si4y137pa
 https://www.bilibili.com/video/BV1si4y137pa?share_source=copy_web
 https://www.bilibili.com/video/BV1si4y137pa?p=2&share_source=copy_web
 
 
01__TCP/IP在开发中的作用？ 用大白话解释什么是Socket__22:58
02__恭喜你发现本次课程隐藏福利__00:47
03__面试官，不要再问我三次握手和四次挥手__53:34
04__100%弄明白5种IO模型__05:49
05__一堂课搞定计算机硬件及组成原理__19:20
06__IO与Netty了解一下！网络通信框架是这样构成的！__41:17
07__详解NIO与BIO的区别，NIO的运行原理及并发使用场景__25:12
08__深入浅出搞懂BIO、NIO、AIO，Nio的优势和弊端__09:41
09__Linux下I/O多路复用系统调用(select, poll, epoll)底层原理__10:54
10__Linux I/O复用中select poll epoll模型的介绍及其优缺点的比较__09:17
11__10分钟看懂Java NIO 底层原理__1:02:46
12__课程答疑__57:20
13__什么是SSLTLSHTTPSX509，SSL只能用在HTTP上吗__22:08
14__Https底层原理，对称加密与非对称加密__52:25
15__CA机构参与与CA伪造__14:18
16__全网深度最深，广度最广的架构师课程介绍__28:43
 
 
 */

#pragma mark
#pragma mark -->> HTTP/HTTPS：你连HTTPS原理都不懂，还给我讲“中间人攻击”?

/**
 共17节
 https://www.bilibili.com/video/BV1Up4y1i7PG
 https://www.bilibili.com/video/BV1Up4y1i7PG?share_source=copy_web
 https://www.bilibili.com/video/BV1Up4y1i7PG?p=2&share_source=copy_web
 
 
01__HTTPS底层原理揭秘 （上）__45:01
02__HTTPS底层原理揭秘 （下）__50:56
03__权威讲解nio,epoll,多路复用，更好的理解redis/nginx/netty/kafka等热门技术__59:01
04__权威讲解nio,epoll,多路复用，更好的理解redis/nginx/netty/kafka等热门技术__40:31
05__TCP的罪与罚，三次握手与四次挥手__57:56
06__TCP的罪与罚，三次握手与四次挥手__42:05
07__从 #HTTPS 开始，互联网项目安全问题汇总__40:13
08__从 #HTTPS 开始，互联网项目安全问题汇总（下）__47:50
09__从HTTPS开始深入底层直到年薪百万（上）__50:07
10__从HTTPS开始深入底层直到年薪百万（下）__1:04:46
11__课程大纲介绍__01:50
12__课程发展历程__18:13
13__给应届生相进大厂的一些建议__20:46
14__社招进大厂学习路线指引__15:30
15__三四线城市跳槽涨薪__03:38
16__年龄大，技术差，温水煮青蛙__42:56
17__非计算机专业学习路线图规划__37:21
 
 
 */

#pragma mark
#pragma mark -->> 多线程: 也只有马士兵，能够从计算机组成原理讲起，带你掌握程序，进程，线程的概念，内存模型，并行与并发，彻底理解多线程在CPU层级的实现

/**
 共17节
 https://www.bilibili.com/video/BV1vv411k7L3?spm_id_from=333.788.b_636f6d6d656e74.30
 https://www.bilibili.com/video/BV1vv411k7L3?share_source=copy_web
 https://www.bilibili.com/video/BV1vv411k7L3?p=2&share_source=copy_web
 
 
01__本次课程介绍—必听__02:48
02__计算机组成，程序运行的底层原理__23:11
03__线程切换以及，Java，GO,rest线程模型__14:57
04__Java里面有没有协程__01:08
05__锁的概念__14:59
06__synchronized关键字的字节码原语__41:38
07__偏向锁升级过程__24:52
08__小结，马老师在线答疑，P8课程介绍__1:05:44
09__CPU，内存，缓存，缓存行详解__28:04
10__缓存一致性协议，FalseSharing以及其编程技巧__15:52
11__CPU乱序执行概念丨CPU乱序执行的证明DCL为什么不能乱序volatil__36:49
12__volatile如何阻止乱序丨内存屏障__10:25
13__硬件级别的内存屏障到底怎么实现__10:45
14__马士兵老师在线给同学们定制化学习__13:18
15__P8架构师课程介绍__14:13
16__马士兵老师职业规划__1:00:59
17__P6还是P7 30W还是50W这道题是分水岭__2:10:51

 
 */
 
#pragma mark
#pragma mark -->> JVM:建议收藏丨马士兵亲授：JVM调优实战丨Jvm垃圾回收原理丨垃圾回收算法丨PB级大数据项目实战
//
/**
 共13节
 https://www.bilibili.com/video/BV1AZ4y147fD
 https://www.bilibili.com/video/BV1AZ4y147fD?share_source=copy_web
 https://www.bilibili.com/video/BV1AZ4y147fD?p=2&share_source=copy_web
 
 
01__系统上线前预估系统的内存占用情况__24:43
02__系统上线前预估系统的并发访问情况__30:01
03__根据预估值设定JVM初始参数__30:01
04__根据日志解决实战问题__1:02:09
05__为什么一个百万级TPS系统会频繁GC？__30:01
06__用top命令观察系统运行情况__30:01
07__用jstack定位问题线程__03:41
08__P8架构师介绍__12:36
09__应届生进大厂学习路线规划__05:06
10__大专生怎么进大厂？__15:52
11__社招生怎么就进大厂？__15:43
12__3，4线城市跳槽涨薪，年龄大，技术差温水煮青蛙该怎么提升__46:32
13__非计算机专业怎么自身学历的短板__14:06
 */

#pragma mark
#pragma mark -->> REDIS:Redis深度解析丨Redis秒杀系统项目实战丨Redis架构丨Redis vs zookeeper分布式锁丨吊打阿里P7面试官的硬核Redis技能
/**
 共10节
 https://www.bilibili.com/video/BV1aC4y1W7Rs
 https://www.bilibili.com/video/BV1aC4y1W7Rs?share_source=copy_web
 https://www.bilibili.com/video/BV1aC4y1W7Rs?p=2&share_source=copy_web
 
 
01__Redis的5大Value类型解析丨清华架构师直播讲解丨吊打面试官的redis技能 P1__29:48
02__Redis实现活跃用户用户统计丨清华架构师直播讲解丨吊打面试官的redis技能 P2__30:08
03__Redis实现秒杀抢购排行榜评论列表丨清华架构师讲解丨吊打面试官的redis技能P3__30:04
04__redis实现推荐系统抽奖商品详情页丨清华架构师讲解丨吊打面试官的redis技能P4__52:09
05__Linux系统的支持：fork、copy on write丨清华架构师讲解 P5__23:21
06__Redis的持久化：RDB、AOF、RDB&AOF混合使用 P6__30:05
07__通过Redis学AKF划分原则、CAP定理 p7__30:01
08__Redis vs zookeeper分布式锁的探索 P8__30:01
09__Redis压力测试、调优点P9__30:01
10__面向未来，学习路线指引与职业规划P10__1:00:00
 */
 

#pragma mark
#pragma mark -->> netty:清晰明了丨从nio,epoll一直学到netty丨吊打面试官硬核技能丨计算机网络全解析丨马士兵教育
 
/**
 https://www.bilibili.com/video/BV1gK4y147iB
 https://www.bilibili.com/video/BV1gK4y147iB?share_source=copy_web
 https://www.bilibili.com/video/BV1gK4y147iB?p=2&share_source=copy_web
 
 
01__操作系统中的BIONIOSELECTPOLLEPOLL实现__24:04
02__JDK中的NIO是什么__30:04
03__什么是selector、bytebuffer、channel__30:04
04__netty的reactor模型原理__37:59
 05__Eventloopgroup、pipeline、handler是啥？__30:09
06__netty如何解决粘包拆包__30:01
 
 */

#pragma mark
#pragma mark -->> 微服务系统架构 :马士兵教育2020最新微服务架构课程丨分布式微服务架构丨年薪百万架构师课程丨
//
/**
 共7节
 https://www.bilibili.com/video/BV1Kz4y197Bp
 https://www.bilibili.com/video/BV1Kz4y197Bp?share_source=copy_web
 https://www.bilibili.com/video/BV1Kz4y197Bp?p=2&share_source=copy_web
 
 
01__一节课学会微服务中如何进行服务治理（上）__30:01
02__一节课学会微服务中如何进行服务治理（下）__31:21
03__Spring Cloud微服务注册中心从入门到精通（上）__30:01
04__Spring Cloud微服务注册中心从入门到精通（下）__35:36
05__互联网项目# 该如何在#微服务# 下做系统架构（上）__59:01
06__互联网项目# 该如何在#微服务# 下做系统架构（中）__45:42
07__互联网项目# 该如何在#微服务# 下做系统架构（下）__1:30:21
 
 */

#pragma mark
#pragma mark -->> 权限与会话管理:Spring Cloud下微服务权限方案丨微服务下的权限与会话管理该怎么做

/**
 共5节
 https://www.bilibili.com/video/BV1Yv41167Bp
 https://www.bilibili.com/video/BV1Yv41167Bp?share_source=copy_web
 https://www.bilibili.com/video/BV1Yv41167Bp?p=2&share_source=copy_web
 
 
01__Spring Cloud下微服务权限方案丨微服务下的权限与会话管理该怎么做（上）__59:01
02__Spring Cloud下微服务权限方案丨微服务下的权限与会话管理该怎么做（下）__45:31
03__Spring Cloud下微服务权限方案丨微服务下的权限与会话管理该怎么做 课程发展历程__18:13
04__Spring Cloud下微服务权限方案丨微服务下的权限与会话管理该怎么做 P7课程大纲介绍__01:50
05__Spring Cloud下微服务权限方案丨微服务下的权限与会话管理该怎么做 面向未来，学习路线指引与职业规划__20:06
 
 */

#pragma mark
#pragma mark -->> 坦克大战项目：马士兵老师成名作品丨坦克大战项目丨Java架构师丨Java编程丨Java实战项目

/**
 共26节
 https://www.bilibili.com/video/BV1FV41167C3
 https://www.bilibili.com/video/BV1FV41167C3?share_source=copy_web
 https://www.bilibili.com/video/BV1FV41167C3?p=2&share_source=copy_web
 
 
01__ new出一个窗口__39:20
02__ 设定标题栏内容__28:54
03__ TankFrame从Frame继承+显示__29:53
04__ 认识paint方法，重写__1:14:55
05__ 学习graphics类，画图__39:57
06__ 学习repaint方法__29:57
07__ 实现MyKeyListener，对键盘作出响应__30:00
08__ MyKeyListener从KeyAdapter继承__35:36
09__ 取得具体按键信息__34:16
10__根据具体按键调整坦克位置，持有对方引用__29:52
11__抽象出坦克类，学习使用枚举类型__1:09:44
12__把监听处理类MyKeyListener放到TankFrame内mp4__40:34
13__用匿名内部类处理窗口关闭__29:52
14__根据按键状态，改变坦克方向__1:08:16
15__根据坦克方向移动位置__30:43
16__能停，能动__29:54
17__test包，关于classloader的知识__1:35:56
18__将坦克换成图片版__41:21
19__画出一颗子弹，让子弹飞一会儿__29:59
20__课程大纲介绍__01:50
21__课程发展历程__18:13
22__非计算机专业学习路线图规划__37:21
23__给应届生相进大厂的一些建议__20:46
24__年龄大，技术差，温水煮青蛙__42:56
25__三四线城市跳槽涨薪__03:38
26__社招进大厂学习路线指引__15:30
 
 */


#pragma mark
#pragma mark -->> 网约车项目：阿里P8架构师SpringCloud Alibaba+Redis构建分布式微服务网约车项目实战

/**
 共48节
 https://www.bilibili.com/video/BV1Kr4y1c75e
 https://www.bilibili.com/video/BV1Kr4y1c75e?share_source=copy_web
 https://www.bilibili.com/video/BV1Kr4y1c75e?p=2&share_source=copy_web
 
 
01__单体到分布式微服务项目演变前言__09:56
02__Nginx单机高并发优化思路__15:49
03__分布式系统的架构思路__21:42
04__负载均衡技术原理浅析与项目维度的结合__17:07
05__Nginx vs LVS 软负载均衡技术选型总结__24:51
06__微服务该如何进行服务治理？__23:30
07__从面试官视角解析如何拿到高薪offer，如何和面试官互动__20:17
08__从单体架构到微服务的演变之路总结__43:43
09__微服务演化过程和特点__18:34
10__SpringCloud微服务生态体系架构开发实战__18:03
11__Spring Cloud Netflix 和Spring Cloud alibaba服务技术架构__29:23
12__微服务架构之技术选型及架构设计__19:16
13__Sentinel整合Spring Cloud Gateway使用Nacos实现动态限流__27:32
14__SpringCloud微服务组件生态体系 SpringCloud Netfli__16:43
15__微服务实战中如何理解服务熔断和降级的区别__41:53
16__服务注册中心+服务发布与注册+服务发现与调用+服务监控__19:16
17__微服务Springcloud超详细教程+实战总结__1:03:45
18__10个微服务架构设计的最佳实践__22:38
19__亿级流量系统架构之CAP定理__19:11
20__从零开始构建微服务项目各组件应用场景及代码实现__26:11
21__服务熔断__22:03
22__微服务治理之道__38:33
23__SpringCloud Alibaba 一节课搞定 #新版微服务__37:46
24__计算向数据移动、而非数据向计算移__24:10
25__redis的5大Value类型解析__24:01
26__redis实现活跃用户__24:01
27__redis实现秒杀__24:01
28__redis实现排行榜__24:01
29__redis实现推荐系统__03:40
30__小结，周老师直播答疑与职业规划__1:48:52
31__linux系统的支持：fork、copy on write__45:01
32__redis的持久化：RDB、AOF、RDB&AOF混合使用__30:15
33__学习路线规划，职业生涯指引__2:22:56
34__飞滴出行网约车项目__19:35
35__网约车项目架构师设计__15:00
36__网约车项目架构师设计__16:08
37__网约车项目架构师设计__31:59
38__网约车项目架构师设计代码实现__27:00
39__VIP课程介绍__1:38:45
40__网约车项目-开发编码、测试__20:01
41__网约车项目-开发编码、测试__20:01
42__网约车项目-部署__20:01
43__网约车项目-部署__20:01
44__网约车项目-部署__20:01
45__网约车项目-部署__20:01
46__网约车项目-Spring Cloud Alibaba改造__20:01
47__网约车项目-Spring Cloud Alibaba改造__20:01
48__网约车整体项目分享__43:26
 
 */


#pragma mark
#pragma mark -->> Java面试：2020年11月Java面试必问的100个核心知识点【100集】全部掌握30K没问题！

/**
 共100节
 https://www.bilibili.com/video/BV14K411K7oF
 https://www.bilibili.com/video/BV14K411K7oF?share_source=copy_web
 https://www.bilibili.com/video/BV14K411K7oF?p=2&share_source=copy_web
 
01__【JVM虚拟机】JVM调优调的是什么？(Java虚拟机参数基本介绍)__04:42
02__【JVM虚拟机】JVM调优应该调哪三个部分？(规划和预调优，生产环境优化，OOM分析)__02:34
03__【JVM虚拟机】第一个OOM案例：银行系统，数据风险分析业务场景__14:56
04__【JVM虚拟机】第一个OOM案例，如何在JVM调优中定位问题(jps,jinfo,jstack,__09:56
05__【JVM虚拟机】第一个OOM案例：生产中为什么不能使用jconsole和jvisualvm__08:21
06__【JVM高级】请解释一下对象的创建过程__09:38
07__【JVM高级】加问DCL与volatile问题(指令重排)__32:32
08__【JVM高级】对象头具体包括什么__14:15
09__【JVM高级】对象怎么定位？__05:28
10__【JVM高级】对象在内存中的存储布局 (对象导数组的存储不同)__07:50
11__【JVM高级】对象怎么分配__15:32
12__【JVM高级】一个Object占多少字节__05:16
13__【JVM高级】Class实例究竞在Method Area还是在Heap__06:24
14__【hashmap】hashmap的数据结构有哪些？__10:27
15__【hashmap】hashmap源码的常量值解释！__15:44
16__【hashmap】hashmap源码的put方法讲解__15:50
17__【hashmap】hashmap 1.7版本的死循环问题__04:00
18__【hashmap】hashmap 1.8版本的源码讲解__24:31
19__【hashmap】hashmap面试总结，面试方法__14:26
20__【TCP/IP】TCP/IP应用层协议原理__32:01
21__【TCP/IP】TCP/IP传输控制层原理__38:01
22__【TCP/IP】TCP /ip 网络层原理__17:01
23__【TCP/IP】TCP/IP 链路层原理__21:38
24__【zookeeper】什么是缓存穿透__08:17
25__【zookeeper】导致缓存穿透的黑客攻击场景一__02:18
26__【zookeeper】导致缓存穿透的黑客攻击场景二__01:08
27__【zookeeper】普通过滤器解决高频缓存穿透的弊端__06:38
28__【zookeeper】布隆过滤器-布隆算法原理__21:55
29__【zookeeper】缓存雪崩的解决方案__06:30
30__【zookeeper】什么是缓存击穿__01:32
31__【zookeeper】缓存击穿的解决方案1__01:03
32__【zookeeper】缓存击穿的解决方案2-分布式锁__18:16
33__【zookeeper】什么是zookeeper,原理剖析__19:12
34__【zookeeper】分布式原理__11:38
35__【zookeeper】分布式锁解决缓存击穿__07:01
36__【zookeeper】关于zookeeper及缓存问题的面试指导__16:19
37__【高并发】面试被问到高并发该怎么说__40:43
38__【高并发】高并发系统中tps是怎么算的__21:20
39__【高并发】如何在传统项目中找到高并发的点__07:01
40__【多线程】计算机组成，程序运行的底层原理__23:11
41__【多线程】线程切换以及，Java，GO,rest线程模型__14:57
42__【多线程】Java里面有没有协程__01:08
43__【多线程】锁的概念__14:59
44__【多线程】synchronized关键字的字节码原语__41:38
45__【多线程】偏向锁升级过程__24:52
46__【多线程】小结，马老师在线答疑，P8课程介绍__1:05:44
47__【多线程】CPU，内存，缓存，缓存行详解__28:04
48__【多线程】缓存一致性协议，FalseSharing以及其编程技巧__15:52
49__【多线程】CPU乱序执行概念丨CPU乱序执行的证明DCL为什么不能乱序volatil__36:49
50__【多线程】volatile如何阻止乱序丨内存屏障__10:25
51__【多线程】硬件级别的内存屏障到底怎么实现__10:45
52__【CPU底层】CUP的组成，CPU怎么样解析程序__40:44
53__【CPU底层】计算机的组成，储存器的层次结构__19:10
54__【CPU底层】CPU缓存，cache line的概念缓存行对齐伪共享__1:00:35
55__【GC调优】什么(怎么确定)是垃圾？(引用计数，RootSearching)__09:00
56__【GC调优】GC算法有哪些？__04:12
57__【GC调优】Java中这些GC算法怎么配合使用__05:06
58__【GC调优】GC算法有哪些？__04:16
59__【GC调优】一个对象从出生到消亡__02:01
60__【GC调优】一些GC的概念和总结__15:01
61__【GC调优】8.GC垃圾收集器__03:26
62__【GC调优】Serial和Serial Old__12:23
63__【GC调优】ParNew__01:14
64__【GC调优】CMS细节原理讲解__13:44
65__【GC调优】Go语言的内存模型__12:18
66__【GC调优】聊聊字节跳动和大厂的薪资__04:01
67__【GC调优】聊聊Rust__11:21
68__【GC调优】CMS 错标对象的修正算法(三色标记算法)__21:05
69__【GC调优】Jvm参数__02:56
70__【redis】计算向数据移动、而非数据向计算移__24:10
71__【redis】计算向数据移动、而非数据向计算移redis的5大Value类型解析__24:01
72__【redis】计算向数据移动、而非数据向计算移redis实现活跃用户__24:01
73__【redis】计算向数据移动、而非数据向计算移redis实现秒杀__24:01
74__【redis】计算向数据移动、而非数据向计算移redis实现排行榜__24:01
75__【redis】计算向数据移动、而非数据向计算移redis实现推荐系统__03:40
76__【redis】计算向数据移动、而非数据向计算移小结，周老师直播答疑与职业规划__1:48:52
77__【redis】计算向数据移动、而非数据向计算移linux系统的支持：fork、copy on write__45:01
78__【redis】计算向数据移动、而非数据向计算移redis的持久化：RDB、AOF、RDB&AOF混合使用__30:15
79__【redis】计算向数据移动、而非数据向计算移学习路线规划，职业生涯指引__2:22:56
80__【redis】redis. kafka. nginx的底层__38:01
81__【redis】redis与zookeeper的集群模型__38:01
82__【redis】分布式工艺和模式__38:01
83__【redis】技术的密码和乐趣__30:43
84__【redis】Redis，zookeeper，kafka，Nginx技术串讲__59:01
85__【redis】Redis，zookeeper，kafka，Nginx技术串讲__45:01
86__【redis】Redis，zookeeper，kafka，Nginx技术串讲__39:49
87__【职业生涯】应届生进大厂学习路线规划__05:06
88__【职业生涯】大专生怎么进大厂？__15:52
89__【职业生涯】社招生怎么就进大厂？__15:43
90__【职业生涯】线城市跳槽涨薪，年龄大，技术差温水煮青蛙该怎么提升__46:32
91__【职业生涯】P8架构师介绍__12:36
92__【职业生涯】非计算机专业怎么自身学历的短板__14:06
93__【计算机网络】tcpip在开发中的作用__11:01
94__【计算机网络】什么是socket__11:01
95__【计算机网络】什么是三次握手四次挥手__11:01
96__【计算机网络】如何应对百万连接，如何制造百万连接__11:01
97__【计算机网络】数据包如何发送出去__11:01
98__【计算机网络】什么是路由表什么IP地址什么是掩码__10:41
99__【基础】引入_课程所需资料获取__00:34
100__【基础】JavaSE进阶，Java工程师就业指导规划__12:01
 */
 

#pragma mark
#pragma mark -->> 源码课程:打造全B站深度最深的Java架构师课程，全B站最好的源码讲解教程，RPC源码，框架源码，Redis源码，并发编程原理，网络通信原理一次学完
 
/**
 共94节
 https://www.bilibili.com/video/BV1v54y147zL
 https://www.bilibili.com/video/BV1v54y147zL?share_source=copy_web
 https://www.bilibili.com/video/BV1v54y147zL?p=2&share_source=copy_web
 
 
01__【学习方式】为什么要学习源码__12:52
02__【学习方式】怎么样学习源码__31:26
03__【学习方式】学习源码技巧和常用工具__12:41
04__【springboot源码】Spring boot是个啥？__06:12
05__【springboot源码】Spring boot的核心，Spring详解__16:22
06__Spring源码解析：BeanFactory深入理解__22:23
07__Spring源码解析：BeanFactory深入理解 下__08:46
08__Spring源码的设计与实现__20:31
09__Spring源码的设计与实现下__43:15
10__BeanPostProcessor的源码学习__23:02
11__Spring boot自动装配原理__21:29
12__Spring boot自动装配原理下__55:17
13__JavaSPI机制详解__02:05
14__总结，怎么看源码__03:47
15__学习中遇到得坑，应该怎么避过这些坑__1:23:29
16__【spring源码】源码方法论__07:58
17__spring前置知识回顾__13:39
18__配置文件的加载流程图示__05:53
19__Ioc创建对象的整体过程图示__14:38
20__Spring中beanFactoryPostProcessor的深入讲解__14:12
21__spring的实例化和初始化的完整过程__18:39
22__环境对象和监听器的深入讲解__05:51
23__debug调试spring的bean的创建过程__32:15
24__学习方法和学习方式总结__11:36
25__spring源码总结__1:11:07
26__什么是循环依赖问题__10:19
27__图解循环依赖问题的解决方式__09:15
28__debug循环依赖的准备工作__08:57
29__循环依赖中B对象的创建__17:01
30__循环依赖中的A对象的创建__16:45
31__循环依赖的三级缓存的迭代__10:16
32__一级缓存能否解决循环依赖问题__08:19
33__二级缓存能否解决循环依赖问题__07:23
34__为什么必须要用三级缓存解决循环依赖问题__19:41
35__循环依赖的总结__10:44
36__spring启动类父类的构造方法执行__15:58
37__设置配置文件路径解析__03:09
38__创建环境对象，包含系统属性__08:43
39__处理配置文件中的占位符__12:59
40__刷新前的准备工作创建spring的beanFactory__47:06
41__beanFactory的属性初始化及扩展工作__19:10
42__spring的配置文件加载1__29:06
43__上节课内容回顾__21:55
44__spring的配置文件加载2__28:36
45__spring的配置文件加载3__16:53
46__spring不同标签的解析分类__17:19
47__默认bean标签的解析__47:42
48__做一个课程总结__02:48
49__【多线程原理】请解释一下对象的创建过程__09:38
50__计算机组成，程序运行的底层原理__23:11
51__线程切换以及，Java，GO,rest线程模型__14:57
52__Java里面有没有协程__01:08
53__锁的概念__14:59
54__synchronized关键字的字节码原语__41:38
55__偏向锁升级过程__24:52
56__小结，马老师在线答疑，P8课程介绍__1:05:44
57__CPU，内存，缓存，缓存行详解__28:04
58__缓存一致性协议，FalseSharing以及其编程技巧__15:52
59__CPU乱序执行概念丨CPU乱序执行的证明DCL为什么不能乱序volatil__36:49
60__volatile如何阻止乱序丨内存屏障__10:25
61__硬件级别的内存屏障到底怎么实现__10:45
62__马士兵老师在线给同学们定制化学习__13:18
63__P8架构师课程介绍__14:13
64__马士兵老师职业规划__1:00:59
65__【RPC源码】RPC是什么？__05:51
66__第1个方式解析RPC（最原始的方式）__17:59
67__第2个版本解析RPC__04:18
68__第3个版本解析RPC__17:56
69__第4个版本解析RPC__09:34
70__第5个版本解析RPC__02:46
71__第6个版本解析RPC__06:30
72__第7个版本解析RPC__07:37
73__第8个版本解析RPC__04:56
74__第9个版本解析RPC__05:25
75__第10个版本解析RPC +课程总结__14:45
76__【redis源码】计算向数据移动、而非数据向计算移__24:10
77__redis的5大Value类型解析__24:01
78__redis实现活跃用户__24:01
79__redis实现秒杀__24:01
80__redis实现排行榜__24:01
81__redis实现推荐系统__03:40
82__小结，周老师直播答疑与职业规划__1:48:52
83__linux系统的支持：fork、copy on write__45:01
84__redis的持久化：RDB、AOF、RDB&AOF混合使用__30:15
85__学习路线规划，职业生涯指引__2:22:56
86__为什么要学习IO，以及本次课程如何学习__05:49
87__计算机里面有哪些硬件组成以及运行原理__19:20
88__【netty原理】网络通信IO的演变过程__41:17
89__内核怎么去实现，以及NIO原理详解__25:12
90__nio的优势和弊端__09:41
91__多路复用器原理详解__10:54
92__select poll,多路复用器优势__09:17
93__NIO EPOLL深度原理解析__1:02:46
94__课程答疑__57:20
 
 */

#pragma mark
#pragma mark -->> 职业生涯：马士兵老师丨清华大学毕业，上市公司总裁丨无数Java程序员启蒙导师给万千Java程序员规划成长路线/社招生，应届生如何进BATJ等大厂，如何摆脱程序员35岁魔咒
 
/**
 共7节
 https://www.bilibili.com/video/BV15t4y1Q736
 https://www.bilibili.com/video/BV15t4y1Q736?share_source=copy_web
 https://www.bilibili.com/video/BV15t4y1Q736?p=2&share_source=copy_web
 
 
01__课程发展历程__01:21
02__P8架构师介绍__12:36
03__应届生进大厂学习路线规划__05:06
04__大专生怎么进大厂？__15:52
05__社招生怎么就进大厂？__15:43
06__线城市跳槽涨薪，年龄大，技术差温水煮青蛙该怎么提升__46:32
07__非计算机专业怎么自身学历的短板__14:06
 
 */

#pragma mark
#pragma mark -->> 架构思维：12个月磨一剑，千万级电商项目从0到1到100全过程 涵盖Java程序员不同成长阶段的问题及优选解决方案！
/**
  
 https://www.bilibili.com/video/BV1Z64y1f7eH?spm_id_from=333.788.b_636f6d6d656e74.41
 就一节
 https://www.bilibili.com/video/BV1Z64y1f7eH?share_source=copy_web
 
 */

#endif /* java_____h */
