//
//  java_图灵学院.h
//  MyCode
//
//  Created by New_iMac on 2021/4/27.
//  Copyright © 2021 mycode. All rights reserved.
//

#ifndef java______h
#define java______h


/*
 2021版Java架构师课程全套视频300集(图灵学院)

// 第一节
https://www.bilibili.com/video/BV1uX4y1u7q3?share_source=copy_web
// 第二节
https://www.bilibili.com/video/BV1uX4y1u7q3?p=2&share_source=copy_web

01_Spring框架介绍及搭建__2:13:26__
02_SpringIoC的xml配置使用__3:05:23
03_SpringIoC的注解使用__1:35:40
04_SpringIoC的javaconfig使用__1:23:31
05_SpringAOP介绍与使用__1:51:48
06_SpringAOP使用详解__2:08:46
07_Spring声明式事务__2:36:58
08_spring源码详解__3:57:10
 
09_security_1_基础概念__12:19
10_security_1_课程介绍V2__03:19
11_security_2_basicAuth__24:29
12_security_3_1_项目搭建__05:57
13_security_3_2_重现basicAuth__25:32
14_security_3_3_框架扩展功能1__19:24
 
15_nginx 安装 简介__16:37
16_nginx 配置文件__19:28
17_nginx代理模式__21:10
18_nginx负载均衡__22:07
19_Nginx限流__19:57
20_nginx动静分离__09:32
21_Nginx 调优+镜像服务器__16:54
22_nginx热备__20:56
23_nginx安全认证__13:39
 
24_课程介绍__04:33
25_数据操作框架历程__19:45
26_Mybatis介绍__16:24
27_快速搭建mybatis__1:35:10
28_MyBatis的配置文件详解__06:48
29_SqlSessionFactory讲解__32:02
30_SqlSession讲解__22:59
31_集成日志框架__53:33
32_全局配置-已有配置讲解__22:36
33_全局配置-properties__05:58
34_全局配置-settings-02__08:27
35_全局配置-settings-03__23:28
36_全局配置-typeAliases__26:30
37_mapperXML 增删改__57:52
38_使用maven继承方式创建项目演示__16:17
39_参数获取__22:56
40_参数处理__58:49
41_结果处理__40:33
42_高级查询结果映射__14:16
43_联合查询结果映射__14:00
44_高级查询结果映射-总结__08:09
45_一对多结果映射__30:37
46_延迟加载__23:28
47_多对一结果映射__20:09
48_动态sql-课前__26:19
49_动态sql-if__09:18
50_动态sql-choose__16:16
51_动态sql-foreach__15:35
52_动态sql-set__09:30
53_动态sql-bind&sql片段__20:40
54_动态sql-其他&OGNL__12:08
55_动态sql-批量插入__25:49
56_一级缓存__44:02
57_整合第三方缓存__21:06
58_二级缓存__1:23:07
59_分页插件、代码生成器__02:24
60_分页插件的使用__1:10:28
61_分页插件原理__1:08:29
62_Mybatis逆向工程__57:59
63_SSM整合__18:42
64_SSM整合__21:24
65_SSM整合__55:39
66_模式意图和场景讲解__03:57
67_懒汉模式&饿汉模式__14:41
68_类加载过程讲解__17:10
69_字节码重排序多线程环境下单例模式问题分析__11:36
70_枚举单例单例模式原理解析__15:54
71_单例模式在spring框架中的应用__14:28
72_单例设计模式精讲__22:45
73_单例设计模式__1:18:22
74_工厂方法模式__15:39
75_抽象工厂模式__16:42
76_建造者模式__24:26
77_原型模式__35:18
78_享元模式__13:50
79_门面模式__11:00
80_适配器模式__18:11
81_装饰器模式__11:35
82_策略模式__22:26
83_模板方法模式__12:04
84_观察者模式__13:20
85_责任链模式__15:19
86_单一职责原则__12:13
87_开闭原则__10:09
88_里氏替换原则__10:23
89_接口隔离原则__04:52
90_依赖倒置原则__07:39
91_红黑树结构详解__21:49
92_红黑树的构建与平衡算法详解__30:05
93_现场手写红黑树__30:03
94_如何快速掌握数据结构的精髓__49:35
95_索引数据结构红黑树，HASH，B+树详解__21:30
96_索引是怎么支撑千万级表的快速查找__33:50
97_如何基于索引B+树精准建立高性能索引__30:02
98_如何快速掌握常见数据结构与算法__33:59
99_jdk的体系结构回顾讲解__05:30
100_jvm内存核心组成解析__06:36
101_线程栈及栈帧结构讲解__11:38
102_局部变量表与操作数栈讲解__17:46
103_动态链接与方法出口讲解__15:31
104_堆内存详细讲解__10:04
105_jvm诊断工具调优实战__14:28
106_亿级流量电商网站jvm参数调优实战__14:22
107_阿里面试题：能否对jvm调优，让其几乎不发生full gc__09:46
108_java虚拟机常见面试题剖析__1:16:07
109_索引的本质讲解__08:17
110_索引数据结构红黑树，hash，b+树详解__10:27
111_千万级数据表如何用索引快速查找__16:30
112_mylsam索引讲解__07:16
113_innodb索引讲解（聚集索引）__09:41
114_（蚂蚁金服面试题）为什么dba总推荐使用自增主键做索引__21:29
115_mysql最左前缀优化原则__09:11
116_阿里mysql索引性能优化最佳实践__1:48:36
117_cpu多核并发缓存架构与jmm模型讲解__06:59
118_多线程内存模型jmm底层原理详解__07:14
119_jmm数据原子操作讲解__10:22
120_cpu缓存一致性协议剖析__07:36
121_volatile可见性底层实现原理解析__13:45
122_cpu指令重排是怎么回事__10:26
123_as-if-serial与happens-before原则讲解__14:28
124_高并发下双重检测锁dcl指令重排问题剖析__17:55
125_深入hotspot源码理解内存屏障如何禁止指令重排__18:06
126_互联网公司中并发编程的应用__1:31:22
127_从hotspot源码看下并发同步原语设计机制__08:31
128_讲透无锁、偏向锁、轻量级锁、重量级锁__13:56
129_从汇编底层深度理解cas机制__17:01
130_cas机制与aba问题__12:10
131_Synchronized底层的锁优化机制__17:14
132_从hotspot底层对象结构理解锁膨胀升级过程__26:45
133_深入jdk源码理解longadder的分段cas优化机制__37:23
134_bat大厂高并发项目锁优化最佳实践__55:59
135_判断可回收垃圾对象__05:45
136_引用计数法解析__08:35
137_可达性分析算法解析__06:21
138_jvm垃圾回收算法深度剖析__10:10
139_常用垃圾收集器解析__09:09
140_jvm内存模型深度剖析__21:33
141_jvm垃圾回收调优工具使用详解__08:01
142_g1与zgc垃圾回收器剖析__22:07
143_百万级交易系统jvm内存调优实战__1:19:18
144_mvc模型由来讲解__06:30
145_springmvc执行流程图解形式深度剖析__19:26
146_springmvc底层源码深度剖析__14:19
147_springmvc控制器不同实现方式与底层源码解析__14:41
 148_springmvc参数注入解密__26:22
149_spring容器与springmvc容器关系深度剖析__13:53
150_spring与springmvc常见面试题解读__52:46
151_redis核心概念以及应用场景介绍__06:35
152_string数据结构讲解__14:39
 153_redis底层设计原理讲解（上）__13:35
154_redis底层设计原理讲解（下）__12:19
155_redis底层设计原理源码解读__13:10
156_redis db主体数据结构串讲__14:54
157_整形编码讲解__10:34
158_redis object讲解__12:14
 
159_一线大厂redis核心技术解析__1:06:36
160_什么是zookeeper__05:29
161_zookeeper文件系统的数据结构__09:32
162_文件系统的数据结构实战讲解__23:17
163_zookeeper事件监听机制__05:40
164_分布式注册中心__16:28
165_分布式锁的加锁过程讲解__04:27
166_zookeeper分布式锁的羊群效应__09:27
167_zookeeper分布式锁实战应用讲解__16:40
168_curator分布式锁源码分析__13:39
169_zookeeper经典问题解析__57:01
170_redis的五种数据结构讲解__02:23
171_string结构与应用场景讲解__18:35
172_hash结构与应用场景讲解__18:57
173_list结构与应用场景讲解__16:42
174_set结构与应用场景讲解__19:01
175_实例讲解：集合操作实现微博微信关注模型__10:12
176_zset有序集合结构与应用场景__05:14
177_一线大厂redis深度学习路线指引__1:32:54
178_秒杀下单减库存实例讲解__08:34
179_模拟高并发场景秒杀下单超卖bug__10:11
180_入门级分布式锁的实现__06:20
181_秒杀场景下实战jvm级别锁与分布式锁__10:59
182_大厂分布式锁redisson框架实战__15:29
183_redisson源码分析__11:17
184_从cap角度剖析redis&zookeeper锁架构异同__10:45
185_redis主从架构锁失效问题及redlock详解__06:02
186_如何提升分布式锁的性能__2:06:06
187_亿级流量电商网站微服务架构讲解__11:09
188_订单系统和库存系统实战讲解__10:45
189_nacos注册中心实现电商微服务拆分实战__08:12
190_基于ribbon调用服务接口__14:13
191_ribbon多实例服务负载均衡调用实战__16:41
192_sentine服务高可用降级讲解__04:18
193_sentinel服务高可用限流讲解__09:00
194_sentinel服务高可用熔断讲解__05:49
195_sentinel服务高可用限流熔断降级底层原理讲解__13:19
196_微服务架构下的分布式事务seata实战__19:02
197_路由&限流&安全认证网关gateway实战__11:45
198_阿里京东后端微服务中台架构实战__1:27:51
199_BATJ大厂面试VIP班（架构师）第1讲__2:18:43
200_BATJ大厂面试VIP班（架构师）第2讲__1:59:55
201_BATJ大厂面试VIP班（架构师）第3讲Exception和Error的区别__18:55
202_BATJ大厂面试VIP班（架构师）第4讲final、finally、 finalize的区别__15:26
203_BATJ大厂面试VIP班（架构师）第5讲String、StringBuffer、StringBuilder的区别__14:21
204_BATJ大厂面试VIP班（架构师）第6讲什么情况下Java程序会产生死锁__18:26
205_BATJ大厂面试VIP班（架构师）第7讲java并发类库中的线程池__17:24
206_BATJ大厂面试VIP班（架构师）第9讲hashmap原理__17:52
207_BATJ大厂面试VIP班（架构师）第10讲Spring Aop原理实现__14:28
208_BATJ大厂面试VIP班（架构师）第11讲Mysql索引底层数据结构__31:42
209_BATJ大厂面试VIP班（架构师）第12讲dubbo面试题__13:13
210_BATJ大厂面试VIP班（架构师）第13讲BATJ面试专题-零拷贝__14:44
211_BATJ大厂面试VIP班（架构师）第14讲BATJ面试专题-生产者消费者-阻塞队列__26:16
212_BATJ大厂面试VIP班（架构师）第15讲BATJ面试专题-Java是如何实现异常处理的__20:47
213_BATJ大厂面试VIP班（架构师）第16讲BATJ面试专题-单例模式__26:16
214_BATJ大厂面试VIP班（架构师）第17讲BATJ面试专题-False Sharing__20:33
215_BATJ大厂面试VIP班（架构师）第17讲LongAdder__18:16
216_BATJ大厂面试VIP班（架构师）第18讲原子变量__25:14
217_BATJ大厂面试VIP班（架构师）第19节TCP半包粘包__16:08
218_BATJ大厂面试VIP班（架构师）第20讲.微服务架构之分布式事务解决方案__2:21:12
219_BATJ大厂面试VIP班（架构师）第21讲.JVM第一节课深入理解Java虚拟机__2:12:12
220_BATJ大厂面试VIP班（架构师）第22讲事物隔离级别与传播特性__21:34
221_BATJ面试题讲解分享（二）__07:56
222_BATJ面试题讲解分享（一）__28:06
223_Dubbo 并发连接底层探究__28:14
224_Dubbo 并发连接底层探究__28:14
225_Dubbo 调用模块详解__16:50
226_ELK应用介绍及集群环境搭建实践__21:05
227_ES入门及核心技术讲解__26:53
228_ES使用进阶：基于电商项目实战__33:48
229_GC日志格式详解__23:58
230_GC调优实站__17:51
231_Git服务搭建与版本分支管理__1:47:04
232_Git基本概念与核心命令掌握__1:41:46
233_IOC容器设计理念与源码解读__21:05
234_Java NIO详解__27:42
235_JVM整体结构与垃圾回收算法介绍__23:34
236_kafka集群搭建与使用__15:03
237_kafka设计原理分析__30:25
238_Linux用户权限与shell脚本介绍__1:46:56
239_Linux整体介绍与常用命令使用__1:44:07
240_Maven基本概念与核心配置__1:55:18
241_Maven私服使用与插件开发__1:57:50
242_MongoDB 快速上手开发__13:03
243_MongoDB 企业应用特性解析__32:04
244_Mybatis核心应用配置与原理解析__1:56:44
245_Mybatis实现与集成缓存__20:13
246_Mysql索引数据结构详解__15:48
247_Mysql执行计划与索引详解__29:09
248_Netty RPC框架实战__29:33
249_Netty编码解码框架解析__15:58
250_Netty介绍与实战__22:33
251_Netty线程模型解析__26:46
252_Nginx 核心模块与配置实践__21:09
253_Nginx 生产环境常规应用__20:27
254_Redis集群演变过程&集群部署__30:22
255_Redis特性介绍与实操__22:47
256_Rocketmq特性详解&场景介绍__18:53
257_Rocketmq之源码分析__18:52
258_RPC协议底层原理与实现__26:50
259_Spring AOP原理解析__25:47
260_spring mvc 原理深度解析-理论基础__15:35
261_spring mvc 原理深度解析-配置应用__1:54:15
262_spring 声明示事物剖析__11:31
263_Spring5新特性__42:44
264_SQL索引优化实战__16:30
265_ss的介绍中间件的比较&传统数据库瓶颈__06:23
266_ss的快速开始与核心概念__13:05
267_ss的实战场景&atlas对比__08:36
268_SS的源码分析__27:06
269_Tomcat生产环境应用__21:14
270_zookeeper源码分析&运维项目实战__21:38
271_zookeeper之zkclient&curator详解__10:55
272_并发BlockingQueue框架原理解析__2:00:02
273_并发Fork-join框架原理解析JDK7和JDK8对比__17:15
274_并发编程之atomic&collections详解__20:19
275_并发编程之Executor线程池详解__19:44
276_并发编程之JMM&Lock&Tools详解__42:13
277_并发编程之定时线程池&DCL__2:00:01
278_场景介绍&快速入门与集群部署__15:10
279_初识消息中间件&部署与快速开始特性__12:42
280_从0到1整体认知分布式系统__17:48
281_分布式任务调度平台XXL-JOB分享__1:43:52
282_基础业务-交易模块详解&后台模块__15:30
283_基础业务-商品模块讲解&会员模块__08:03
284_基础业务-支付模块__08:17
285_基于Jenkins构建企业持续集成环境__1:47:26
286_基于netty 构建高性弹幕系统__04:03
287_集群运维&原理分析__24:44
288_交易模块分库分表实战二__11:21
289_交易模块分库分表实战一__12:41
290_开发分布式Zookeeper项目__19:46
291_客户端详解与源码分析__1:58:59
292_快速掌握Dubbo企业常规应用__29:56
293_快速掌握Jenkins原理与核心功能__1:54:15
294_类加载器深入解析__07:34
295_秒杀系统设计与实现&秒杀系统压测__03:36
296_企业级Redis项目tlcache开发__08:58
297_深入理解Mysql锁与事务隔离级别__16:05
298_徒手实现线程池ThreadPoolExecutor__19:02
299_系统架构-电商系统架构发展历程&架构讲解__1:39:57
300_整体认识mybatis和mybatis的体系结构__1:45:57
 
 
 */



#endif /* java______h */
